<template>
  <div class="wrapper-content">
    <div class="content">
      <h1>В нотации BPMN имеются следующие базовые графические элементы:</h1>
      <ul class="list">
        <li>Пул и Дорожки</li>
        <li>Действия</li>
        <li>События</li>
        <li>Потоки</li>
        <li>Артефакты</li>
      </ul>
      <h1>BPMN элементы "Пул" и "Дорожка":</h1>
      <img src="../../assets/img/guide/element1.png" alt="пул и дорожка">
      <p class="p-big">
        Весь бизнес-процесс состоит из пулов: совокупности операций + лиц, которые эти операции выполняют.
        Например, пулом окажется весь набор действий по погрузке товара и отправке его клиенту.
        При этом выделяют так называемые “дорожки”, из которых состоит любой пул.
        Для нашего примера одной из дорожек станет оформление документов,
        касающихся погрузки и отправки товара, второй дорожкой – физическая погрузка нужной партии
        на автомобиль и поездка автомобиля к клиенту. Обе эти дорожки дополняют одна другую,
        проходят параллельно, но в целом служат выполнению одного и того же этапа бизнес-процесса.
      </p>
      <h2>Пул</h2>
      <div>
        <p class="p-img"><img class="img" src="../../assets/img/guide/element2.png" alt="пул">
          Используется для обозначения границ бизнес-процесса</p>
      </div>

      <h2>Дорожка</h2>
      <div>
        <p><img class="img" src="../../assets/img/guide/element3.png" alt="дорожка" style="width: 150px; height: 309px">
          Используется для отражения ответственных исполнителей и их ролей в процессе</p>
      </div>

      <h1>BPMN элемент "Действие":</h1>
      <div>
        <p><img class="img" src="../../assets/img/guide/element4.png" alt="дорожка">
          Под "действием" понимается единица работы, выполняемой в ходе исполнения бизнес-процесса.
          Действия могут быть как элементарными (задача/task), так и составными (подпроцесс/sub-process).
        </p>
        <p>
          Есть несколько типов элементарных действий, которые отличаются условиями выполнения:</p>
        <div style="margin-top: 50px">
          <ul class="list">
            <li>
              Многократное выполнение действия в рамках одного процесса.
              Например, одно и то же действие может выполняться параллельно
              для каждого товара в заказе клиента.
            </li>
            <li>
              Циклическое действие выполняется многократно, пока заданное условие верно.
              BPMN предполагает следующие графические отображения для основных типов действий:
            </li>
          </ul>
        </div>
      </div>

      <h2>Абстрактная задача</h2>
      <div>
        <p><img class="img" src="../../assets/img/guide/element5.png" alt="Абстрактная задача">
          Используется для обозначения простого действия или операции, не имеющей дальнейшей декомпозиции
          в рамках текущего бизнес-процесса.</p>
      </div>

      <h2>Подпроцесс</h2>
      <div>
        <p><img class="img" src="../../assets/img/guide/element6.png" alt="Подпроцесс">
          Используется для отображения декомпозированного процесса, включенного в состав рассматриваемого процесса.
          Подпроцесс описан более подробно на своей диаграмме.</p>
      </div>

      <h2>Процесс-ссылка</h2>
      <div>
        <p><img class="img" src="../../assets/img/guide/element7.png" alt="Процесс-ссылка">
          Используется для обозначения ссылки на один из наиболее часто повторяющихся процессов.
        </p>
      </div>

      <p class="p-big">
        Здесь стоит отметить, что современные BPM-системы зачастую предлагают более широкий набор типов действий,
        чем предлагает BPMN. Например, в инструменте для моделирования бизнес-процессов
        в Comindware Business Application Platform вы найдёте графические элементы для нескольких типов
        элементарных действий, а также встроенных кейсов:
      </p>

      <h2>Пользовательская задача</h2>
      <div>
        <p><img class="img" src="../../assets/img/guide/element8.png" alt="Пользовательская задача">
          Используется для отображения задачи, которую выполняет человек.
        </p>
      </div>

      <h2>Задача на выполнение сценария</h2>
      <div>
        <p><img class="img" src="../../assets/img/guide/element9.png" alt="Задача на выполнение сценария">
          Используется для отображения шага процесса, по достижении которого автоматически выполняется скрипт.
        </p>
      </div>

      <h2>Задача на вызов сервиса</h2>
      <div>
        <p><img class="img" src="../../assets/img/guide/element10.png" alt="Задача на вызов сервиса">
          Используется для иллюстрации шага процесса, на котором вызывается веб-служба или скрипт С#.
        </p>
      </div>

      <h2>Встроенный кейс</h2>
      <div>
        <p><img class="img" src="../../assets/img/guide/element11.png" alt="Встроенный кейс">
          Используется для представления нестандартной задачи, курируемой ответственным лицом или группой лиц.
          Кейсы используются, когда нужно быстро организовать в рамках процесса неструктурированную или слабоструктурированную активность.
        </p>
      </div>

      <h1>BPMN элементы "Развилка" или "Шлюз":</h1>

      <p>Под шлюзами понимаются элементы, определяющие ветвление и слияние потоков работ.</p>
      <p>BPMN описывает 7 типов развилок. В качестве основных выделяют 2 типа:</p>

      <h2>Шлюз исключающего «или»</h2>
      <div>
        <p><img class="img" src="../../assets/img/guide/element12.png" alt="Шлюз исключающего «или»">
          Используется для создания альтернативных потоков процесса или сходящихся потоков управления.
        </p>
      </div>

      <h2>Параллельный шлюз</h2>
      <div>
        <p><img class="img" src="../../assets/img/guide/element13.png" alt="Параллельный шлюз">
          Используется для создания параллельных путей без оценки какого бы то ни было условия
          или для сходящихся потоков и синхронизации параллельных веток выполнения процесса.
        </p>
      </div>

      <p class="p-big">
        Двух развилок, описанных выше достаточно для построения бизнес-процессов любой сложности. Остальные типы развилок, описанных в BPMN,
        позволяют строить более компактные схемы процессов, но это преимущество многие эксперты ставят под сомнение,
        т.к., маловероятно, что люди без специальной подготовки поймут такие схемы.
      </p>

      <p>Пример использования шлюза исключающего «или» для создания альтернативных потоков процесса:</p>
      <div>
        <ul class="list">
          <li>Этап 7. Звонок клиенту с целью оценить качество обслуживания.</li>
          <li>1. Если клиент доволен, фиксация положительной оценки, закрытие бизнес-процесса.</li>
          <li>2. Если клиент недоволен, выяснение причины.</li>
        </ul>
      </div>

      <div>
        <p><img class="img" src="../../assets/img/guide/element14.png" alt="Шлюз">
          Дальнейшая схема может сильно ветвиться: если клиент недоволен доставкой, то требуется связаться с начальником этой службы;
          а если качеством продукции, то следующим этапом будет передача претензии в отдел производства, либо эскалация
          (поднятие иерархического уровня) с целью донести сведения о такой претензии до более высокого руководства.
        </p>
        <p>Фактически, шлюзы являются одними из самых ответственных и сложных этапов бизнес-процессов.
          От того, насколько грамотно будут прописаны все условия и следствия по принципу “Если… то”,
          во многом зависит эффективность работы всей системы.</p>
      </div>

      <h1>BPMN элемент "Событие":</h1>
      <img src="../../assets/img/guide/element15.png" alt="Событие">

      <p class="p-big">"Событие" является одним из главных элементов BPMN и служит для описания того,
        что должно случиться (в отличие от задачи, когда что-то должно быть сделано).
        Событием может быть, например, подписание договора, или разговор с клиентом.</p>

      <h2>Графические элементы событий в BPMN классифицируют двумя способами:</h2>

      <div>
        <p>1.	В зависимости от положения события на схеме процесса:</p>

        <p><img class="img" src="../../assets/img/guide/element16.png" alt="Начальное событие (инициирующее бизнес-процесс)">
          Начальное событие (инициирующее бизнес-процесс)
        </p>
        <p><img class="img" src="../../assets/img/guide/element17.png" alt="Промежуточное событие">
          Промежуточное событие
        </p>
        <p><img class="img" src="../../assets/img/guide/element18.png" alt="Конечное событие (заканчивающее бизнес-процесс)">
          Конечное событие (заканчивающее бизнес-процесс)
        </p>
      </div>

      <p class="p-big">В случае с доставкой товара начальным событием будет, очевидно, заявка клиента.
        Либо же – звонок менеджера клиенту с предложением совершить покупку.
        Конечным событием в такой цепочке станет факт доставки, подтверждённый подписью клиента.</p>

      <p>2.	По типу события классификация следующая:</p>

      <h2>Простое событие</h2>
      <p><img class="img" src="../../assets/img/guide/element19.png" alt="Простое событие">
        Представляет не типизированное событие
      </p>

      <h2>Событие-сообщение</h2>
      <p><img class="img" src="../../assets/img/guide/element20.png" alt="Событие-сообщение">
        Показывает отправку или получение сообщения
      </p>

      <h2>Событие-сообщение</h2>
      <p><img class="img" src="../../assets/img/guide/element21.png" alt="Событие-сообщение">
        Показывает отправку или получение сообщения
      </p>

      <h2>Событие-таймер</h2>
      <p><img class="img" src="../../assets/img/guide/element22.png" alt="Событие-таймер">
        Используется для моделирования регулярных событий. Также таймер может использоваться для моделирования моментов времени, временных промежутков и превышения лимита времени
      </p>

      <p>Очень часто начальные и конечные события являются событиями-сообщениями.</p>

      <h1>BPMN элементы "Потоки":</h1>

      <p class="p-big">Поток – это последовательность действий, которая обозначается стрелкой.
        Элемент “поток” показывает какое действие после какого необходимо совершить.</p>

      <h2>Поток управления</h2>
      <p><img class="img" src="../../assets/img/guide/element23.png" alt="Поток управления">
        На стандартный поток управления не воздействуют условия и он не проходит через шлюзы, т.е. является неконтролируемым
      </p>

      <h2>Условный поток управления</h2>
      <p><img class="img" src="../../assets/img/guide/element24.png" alt="Условный поток управления">
        Используется для того, чтобы показать, что дальнейшее выполнение процесса будет происходить
        по определённому потоку только в том случае, если выполнятся заданное условие.
        Ромбик у основания стрелки добавляется, если условный поток управления является исходящим от процесса.
        Ромбик не добавляется, если условный поток управления является исходящим от шлюза
      </p>

      <h2>Поток управления по умолчанию</h2>
      <p><img class="img" src="../../assets/img/guide/element25.png" alt="Поток управления по умолчанию">
        Используется тогда, когда необходимо показать, что дальнейшее выполнение процесса будет происходить
        по определённому потоку только если не выполняется ни одно из заданных условий.
      </p>

      <h2>Поток сообщений</h2>
      <p><img class="img" src="../../assets/img/guide/element26.png" alt="Поток сообщений">
        Используется для отображения межпроцессного взаимодействия – отображает передачу
        сообщений или объектов из одного процесса в другой процесс или внешнюю ссылку
      </p>

      <h2>Ассоциация</h2>
      <p><img class="img" src="../../assets/img/guide/element27.png" alt="Ассоциация">
        Применяется для визуализации связи между элементами потока и объектами, не являющимися элементами потока (артефактами).
      </p>

      <h1>BPMN элементы "Артефакт":</h1>
      <p class="p-big">
        Под артефактами в BPMN понимают объекты, которые не влияют на исполнение бизнес-процесса напрямую.
        Это могут быть документы, данные, информация.
      </p>
      <p>Основные виды артефактов:</p>
      <h2>Группа объектов</h2>
      <p><img class="img" src="../../assets/img/guide/element28.png" alt="Группа объектов">
        Используется для группировки графических элементов, принадлежащих одной
        и той же категории и позволяет повысить простоту восприятия диаграммы.
      </p>
      <h2>Текстовая аннотация</h2>
      <p><img class="img" src="../../assets/img/guide/element29.png" alt="Текстовая аннотация">
        Применяется для уточнений к диаграмме – комментариев и пояснений, которые увеличат читабельность диаграммы.
      </p>

      <h2>Объект данных</h2>
      <p><img class="img" src="../../assets/img/guide/element30.png" alt="Объект данных">
        Используется для отображения информации о данных, которые обрабатывается в ходе процесса.
      </p>
    </div>
  </div>
</template>

<script>
export default {
  name: "DescriptionBP"
}
</script>

<style lang="scss" scoped>
.wrapper-content {
  width: 100%;
  height: 100%;
  display: flex;
  justify-content: center;
}
.content {
  display: flex;
  flex-direction: column;
  width: fit-content;
  max-width: 50vw;
  font-family: GraphikCy,'Helvetica CY',Arial,sans-serif!important;
  //font-size: large;
  //font-family: cursive;
}
.list {
  font-size: large;
  margin-top: 7px;
  margin-bottom: 7px;
}
p {
  font-size: large;
}
.p-big {
  text-align: justify;
}
.img {
  float: left;
  margin: auto 10px;
  max-width: 500px;
}
.block-img-text {
  //display: flex;
}
h2 {
  margin-bottom: 0;
  margin-top: 20px;
}
</style>